print('Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть')
coin = int(input('Введиче число монеток: '))
count_up = 0
count_down = 0

for i in range(coin):
    side = (input('Укажите "вверх" или "вниз" повернута моетна : '))
    if side == 'вверх':
        count_up += 1
    else:
        count_down += 1
print(f'Моент повернутых ввех :{count_up}, Моент повернутых вниз : {count_down}')
if count_up > count_down:
    print(count_down)
else:
    print(count_up)
