print('Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.')
sum_numbers = int(input('Введиче сумму чисел: '))
prod_numbers = int(input('Введиче произведение  чисел: '))
for i in range(sum_numbers):
    for j in range(prod_numbers):
        if sum_numbers == i + j and prod_numbers == i * j:
            if i <= 1000 and j <= 1000:
                print(i,j)
            else:
                print('Числа больше задуманных Петей')   
